slint-ui/slint/examples/carousel/esp-idf/s2-kaluga-kit/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32s2"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_COMPILER_OPTIMIZATION_PERF=y
CONFIG_ESP_DEFAULT_CPU_FREQ_MHZ_240=y
CONFIG_FREERTOS_HZ=1000
CONFIG_ESP_MAIN_TASK_STACK_SIZE=13584
CONFIG_COMPILER_CXX_EXCEPTIONS=y
